Case/case8/play/case0/Case/case0/0/U
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class volVectorField;
 location "0";
 object U;
}

dimensions [ 0 1 -1 0 0 0 0 ];

internalField uniform (0 0 0);

boundaryField
{
  floor
  {
    type noSlip;
  }
  ceiling
  {
    type noSlip;
  }
  sWall
  {
    type noSlip;
  }
  nWall
  {
    type noSlip;
  }
  sideWalls
  {
    type empty;
  }
  outlet
  {
    type zeroGradient;
  }
  inlet
  {
    type fixedValue;
    value uniform (0.212132 -0.212132 0);
  }
  glass1
  {
    type noSlip;
  }
  glass2
  {
    type noSlip;
  }
  sun
  {
    type noSlip;
  }
  Table_master
  {
    type noSlip;
  }
  Table_slave
  {
    type noSlip;
  }
} 	// ************************************************************************* //

